---
kind: property
id: P:Autodesk.Revit.UI.RibbonPanel.Enabled
zh: 功能区
source: html/ff32938a-b156-4a6e-c7a1-93c100c18612.htm
---
# Autodesk.Revit.UI.RibbonPanel.Enabled Property

**中文**: 功能区

Gets or sets a value indicating whether the RibbonPanel can respond to user interaction.

## Syntax (C#)
```csharp
public bool Enabled { get; set; }
```